src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/FileStorageTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>FileStorageTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Infobase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VolumesOnHardDisk</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/FileVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>FileVersions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Files</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDateUniversal</Name>
					<Comment>File modification date - converted to Greenwich (without summer and time zone offsets)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Comment for versions</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Extension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentalVersion</Name>
					<Comment>Parent version for current version - tree structure of versions is possible</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextExtractionStatus</Name>
					<Comment>Text extraction status - for a background job of text extraction</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileTextExtractionStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorageType</Name>
					<Comment>Where files are stored - in database as ValueStorage or in directory on drive</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileStorageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Volume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorage</Name>
					<Comment>File Versions</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files/Forms/ItemForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// COMMON PROCEDURES AND FUNCTIONS

&AtClient
Procedure OnOpen(Cancellation)
	SetAccessibilityOfFormItems();
	
	DescriptionBeforeRecord = Object.Description;
	
EndProcedure

// Function is used to copy last version
// from the file-source to the file-receiver
// Parameters:
//	Receiver - ref to the "File" where linked File being copied
//	Source 	 - ref to the "File" from where linked File being copied
&AtServer
Function CreateCopyOfVersion(Receiver, Source)
	
	If Not Source.CurrentVersion.IsEmpty() Then
		
		Version = FileOperations.CreateFileVersion(
			CurrentDate(),
			ToUniversalTime(CurrentDate()),
		    Receiver,
			Object.Description,
			Source.CurrentVersion.Size,
			Source.CurrentVersion.Extension,
			Source.CurrentVersion.FileStorage,
			Source.CurrentVersion.TextStorage,
			False,
			Source.CurrentVersion);

		// Refresh File form (as writing may occur not only on form closing)
		Object.CurrentVersion = Version.Ref;
		
		// Update record in the infobase
		FileOperations.UpdateFileCurrentVersion(Receiver, Version, Source.CurrentVersion.TextStorage, Uuid);
		
	EndIf;
	
EndFunction // CreateCopyOfVersion()

// Adjusts accessibility of form commands and items
&AtClient
Procedure SetAccessibilityOfFormItems()
	
	ActionsWithFileAreAvailable = Not Object.CurrentVersion.IsEmpty() And Not Object.Ref.IsEmpty();
	
	Items.StoreVersions.Enabled 		= ActionsWithFileAreAvailable And Not Object.DeletionMark;
	Items.CancelEdit.Enabled 			= Not Object.LockedBy.IsEmpty();
	Items.OpenFileDirectory.Enabled 	= ActionsWithFileAreAvailable;
	Items.SaveAs.Enabled 				= ActionsWithFileAreAvailable;
	
	Items.Edit.Enabled 			= NOT Object.Signed;
	Items.EndEdit.Enabled 		= Not Object.LockedBy.IsEmpty();
	Items.Details.ReadOnly 	= NOT Object.LockedBy.IsEmpty();
	Items.Take.Enabled 			= Object.LockedBy.IsEmpty() And (ActionsWithFileAreAvailable) And NOT Object.Signed;
	Items.SaveChanges.Enabled 	= Not Object.LockedBy.IsEmpty();
	
	Items.UpdateFromFileOnDisk.Enabled = ActionsWithFileAreAvailable And NOT Object.Signed;
	
EndProcedure

&AtClient
Procedure FullDescrOnChange(Item)
	Object.Details = TrimAll(Object.Details);
	Try
		FileFunctionsClient.CheckForInvalidCharactersInFileName(Object.Details, True);
	Except
		Information = ErrorInfo();
	    DoMessageBox(Information.Details);
	EndTry;
	
	Object.Description = TrimAll(Object.Details);
EndProcedure

&AtClient
Procedure WriteExecute()
	Write();
	Read();
EndProcedure

&AtClient
Procedure CopyExecute()
	
	FileOperationsClient.CopyFile(Object.FileOwner, Object.Ref);

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURES - FORM EVENTS HANDLERS

// Procedure  - handler of the event "OnCreate".
//
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	FileDataCorrect = False;
	
	If Parameters.Property("CreationMode") Then 
		CreationMode = Parameters.CreationMode;
	EndIf;
	
	If Parameters.Property("NewFile") Then 
		NewFile = Parameters.NewFile;
	EndIf;
	
	If Parameters.Key = Undefined Or Parameters.Key.IsEmpty() Then
		
		NewFile = True;
		
		If Parameters.CopyingValue.IsEmpty() Then
			Object.FileOwner = Parameters.FileOwner;
		Else
			Object.CurrentVersion = Catalogs.FileVersions.EmptyRef();
			Parameters.FileBasis = Parameters.CopyingValue;
		EndIf;
		
	EndIf;
	
	DocBasis = Parameters.FileBasis;
	If Not DocBasis.IsEmpty() Then
		
		Object.Details 		= DocBasis.Details;
		Object.Description 		= Object.Details;
		Object.StoreVersions 	= DocBasis.StoreVersions;
		
	EndIf;
	
	If Not Object.Ref.IsEmpty() Then
		FileData = FileOperations.GetFileData(Object.Ref);
		FileDataCorrect = True;
	EndIf;
	
	OwnerType = TypeOf(Object.FileOwner);
	Items.Owner.Title = OwnerType;
	
	NewFileRecorded = False;
	
	// Handler of the subsystem "Properties"
	AdditionalDataAndAttributesManagement.OnCreateAtServer(ThisForm, Object, "");
	
	If Parameters.Property("CardIsOpenAfterFileCreate") Then 
		If Parameters.CardIsOpenAfterFileCreate Then
			
			Try
				LockFormDataForEdit();
			Except
			EndTry;
					
		EndIf;
	EndIf;
	
	If TypeOf(Object.FileOwner) = Type("CatalogRef.FileFolders") Then
		RefreshFullPath();
	EndIf;	
	
	If Not Parameters.FileBasis.IsEmpty() Then
		FileBasisSigned = Parameters.FileBasis.Signed;
	EndIf;
	
	Items.GroupAdditionalDataPages.PagesRepresentation = FormPagesRepresentation.None;
	
EndProcedure

&AtServer
Procedure RefreshFullPath()
	
	If TypeOf(Object.FileOwner) = Type("CatalogRef.FileFolders") Then
		
		FolderParent = Object.FileOwner;
		
		FullPath = "";
		
		While Not FolderParent.IsEmpty() Do
			
			If Not IsBlankString(FullPath) Then
				FullPath = "\" + FullPath;
			EndIf;	
			
			FullPath = String(FolderParent) + FullPath;
			FolderParent = FolderParent.Parent;
			
		EndDo;

		Items.Owner.ToolTip = FullPath;
		
	EndIf;	
	
EndProcedure	

&AtClient
Procedure BeforeClose(Cancellation, StandardProcessing)
	
	If FileWasEdited And FileOperationsSecondUseClient.GetFileOperationsPersonalSettings().CurrentUser = Object.LockedBy Then 
		Response = DoQueryBox(NStr("en = 'File locked by you for edit. Do you want to close the card?'"), QuestionDialogMode.YesNo, ,DialogReturnCode.No);
		If Response = DialogReturnCode.No Then 
			Cancellation = True;
			Return;
		EndIf;	
	EndIf;

	If CreationMode = "FromTemplate" Then
		QuestionString = StringFunctionsClientServer.SubstitureParametersInString(
		  NStr("en = 'Open file ""%1"" for editing?'"),
		  TrimAll(Object.Details) );
		
		If NewFile And NewFileRecorded And (Not FileWasEdited) And DoQueryBox(QuestionString, QuestionDialogMode.YesNo, ,DialogReturnCode.Yes) = DialogReturnCode.Yes Then
			FileOperationsClient.EditFileByRef(Object.Ref, Uuid);
			NotifyChanged(Object.Ref);
			Notify("FileDataModified", Object.Ref);
		EndIf;
	EndIf;
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "FileIsOpen" And Parameter = Object.Ref Then
		NewFile = False;
	EndIf;

	If EventName = "FileWasEdited" And Parameter = Object.Ref Then
		FileWasEdited = True;
	EndIf;

	If EventName = "FileWasEdited" And Parameter = Object.Ref Then
		FileWasEdited = True;
	EndIf;
	
	If EventName = "ObjectSigned" And Parameter = Object.Ref Then
		Read();
	EndIf;
	
	If EventName = "ActiveVersionChanged" And Parameter = Object.Ref Then
		Read();
	EndIf;
	
	// Handler of the subsystem "Properties"
	If AdditionalDataAndAttributesManagementClient.ProcessAlerts(ThisForm, EventName, Parameter) Then
		UpdateAdditionalDataAndAttributesItems();
	EndIf;
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancellation)
	Object.Description = Object.Details;
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancellation, CurrentObject)
	
	// Handler of the subsystem "Properties"
	AdditionalDataAndAttributesManagement.BeforeWriteAtServer(ThisForm, CurrentObject);
	
	If DescriptionBeforeRecord <> CurrentObject.Description Then
		If CurrentObject.CurrentVersion.FileStorageType = Enums.FileStorageTypes.VolumesOnHardDisk Then
			FileOperations.RenameFileVersionFromDisk(CurrentObject.CurrentVersion, DescriptionBeforeRecord, CurrentObject.Description);
		EndIf;
	EndIf;
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject)
	If NewFile Then 
		FileData = FileOperations.GetFileData(Object.Ref);
		FileDataCorrect = True;
	EndIf;
	
	If Not Parameters.FileBasis.IsEmpty() And Object.CurrentVersion.IsEmpty() Then
		CreateCopyOfVersion(Object.Ref, Parameters.FileBasis);
		Modifed = False;
	EndIf;
	
EndProcedure

&AtClient
Procedure AfterWrite()
	If NewFile Then 
		NewFileRecorded = True;
		Read();
		
		AlertParameters = New Structure("Owner, File", Object.FileOwner, Object.Ref);
		Notify("FileCreated", AlertParameters);
		
	Else
		If DescriptionBeforeRecord <> Object.Description Then
			// in cache update file
			FileOperationsClient.UpdateInformationInWorkingDirectory(Object.CurrentVersion, Object.Description);
			DescriptionBeforeRecord = Object.Description;
		EndIf;
	EndIf;
	
	SetAccessibilityOfFormItems();
EndProcedure

&AtClient
Procedure OpenFileExecute()
	
	If Object.Ref.IsEmpty() Then
		Write();
	EndIf;	
	
	FileData = FileOperations.GetFileDataForOpening(Object.Ref, Undefined, 
		Uuid);

	FileOperationsCommands.Open(FileData);
	
EndProcedure

&AtClient
Procedure Edit(Command)
	
	If Object.Ref.IsEmpty() Then
		Write();
	EndIf;	
	
	If Modified Then
		Write();
	EndIf;	
	FileOperationsCommands.Edit(Object.Ref, Uuid);
	Read();
	SetAccessibilityOfFormItems();
	
EndProcedure

// get file data, if it is required
&AtClient
Procedure GetFileDataIfIncorrect()
	If FileData = Undefined OR NOT FileDataCorrect Then
		FileData = FileOperations.GetFileData(Object.Ref);
		FileDataCorrect = True;
	EndIf;
EndProcedure

&AtClient
Procedure EndEdit(Command)
	If Modified Then
		Write();
	EndIf;	
	
	GetFileDataIfIncorrect();
	
	FileOperationsCommands.EndEdit(
		FileData.Ref,
		Uuid,
		FileData.StoreVersions,
		FileData.LockedByCurrentUser,
		FileData.LockedBy);
		
	Read();
	SetAccessibilityOfFormItems();
EndProcedure

&AtClient
Procedure Take(Command)
	If Modified Then
		Write();
	EndIf;	
	FileOperationsCommands.Lock(Object.Ref, Uuid);
	Read();
	SetAccessibilityOfFormItems();
EndProcedure

&AtClient
Procedure CancelEdit(Command)
	If Modified Then
		Write();
	EndIf;	
	
	GetFileDataIfIncorrect();
	
	FileOperationsCommands.UnlockFile(
		FileData.Ref,
		FileData.StoreVersions,
		FileData.LockedByCurrentUser,
		FileData.LockedBy,
		Uuid);
		
	Read();
	SetAccessibilityOfFormItems();
EndProcedure

&AtClient
Procedure SaveChanges(Command)
	If Modified Then
		Write();
	EndIf;	
	
	FileOperationsCommands.SaveAs(Object.Ref);
	
	Read();
	SetAccessibilityOfFormItems();
EndProcedure

&AtClient
Procedure OpenFileDirectory(Command)
	FileData = FileOperations.GetFileDataForOpening(Object.Ref, Undefined, Uuid);
	FileOperationsCommands.OpenFileDirectory(FileData);
EndProcedure

&AtClient
Procedure SaveAs(Command)
	FileData = FileOperations.GetFileDataForSaving(Object.Ref, Undefined, Uuid);
	FileOperationsCommands.SaveAs(FileData);
EndProcedure

&AtClient
Procedure UpdateFromFileOnDisk(Command)
	If Modified Then
		Write();
	EndIf;	
	
	FileData = FileOperations.GetFileData(Object.Ref);
	FileOperationsCommands.UpdateFromFileOnDisk(FileData, Uuid);
	Read();
EndProcedure

&AtClient
Procedure Save(Command)
	
	If Items.TableOfSignatures.CurrentData = Undefined Then
		Return;
	EndIf;	
	
	If Items.TableOfSignatures.CurrentData.Object <> Undefined And (NOT Items.TableOfSignatures.CurrentData.Object.IsEmpty()) Then
		
		SignatureAddress = Items.TableOfSignatures.CurrentData.SignatureAddress;
		
		ExtensionConnected = AttachFileSystemExtension();
		If ExtensionConnected Then
			
			FileOpenDialog = New FileDialog(FileDialogMode.Save);
			Filter = NStr("en = 'All files(*.p7s)|*.p7s'");
			FileOpenDialog.Filter = Filter;
			FileOpenDialog.Multiselect = False;
			FileOpenDialog.Title = NStr("en = 'Select the file to save the signature'");
			
			If FileOpenDialog.Choose() Then
				
				FullPathOfSignature = FileOpenDialog.FullFileName;
				
				File = New File(FullPathOfSignature);
				FilesBeingTransmitted = New Array;
				Details = New TransferableFileDescription(FullPathOfSignature, SignatureAddress);
				FilesBeingTransmitted.Add(Details);
				
				PathToFile = File.Path;
				If Right(PathToFile,1) <> "\" Then
					PathToFile = PathToFile + "\";
				EndIf;
				
				// Save file from DB to a drive
				GetFiles(FilesBeingTransmitted,, PathToFile, False);
					
				Text = StringFunctionsClientServer.SubstitureParametersInString(
					NStr("en = 'The signature is saved in the file ""%1""'"),
					FileOpenDialog.FullFileName);
				Status(Text);
				
			EndIf;
			
		EndIf;		
		
	EndIf;	
	
EndProcedure

&AtClient
Procedure Delete(Command)
	
	If DoQueryBox(NStr("en = 'Delete selected signature?'"), QuestionDialogMode.YesNo) <> DialogReturnCode.Yes Then
		Return;
	EndIf;	
	
	AttributeSignedChanged = False;
	
	If AttributeSignedChanged Then
		NotifyChanged(Object.Ref);
		Read();
	EndIf;
	
	Notify("AttachedFileSigned", Object.FileOwner);
	
	SetAccessibilityOfFormItems();
	
EndProcedure


////////////////////////////////////////////////////////////////////////////////
// PROCEDURES OF PROPERTIES SUBSYSTEM

&AtClient
Procedure Pluggable_EditContentOfProperties()
	
	AdditionalDataAndAttributesManagementClient.EditContentOfProperties(ThisForm, Object.Ref);
	
EndProcedure

&AtServer
Procedure UpdateAdditionalDataAndAttributesItems()
	
	AdditionalDataAndAttributesManagement.UpdateAdditionalDataAndAttributesItems(ThisForm, FormAttributeToValue("Object"));
	
EndProcedure

&AtClient
Procedure OwnerOnChange(Item)
	
	RefreshFullPath();
	
EndProcedure
